#По спискам роста N учеников группы необходимо определить рост и количество самого высокого ученика среди них.
#Найдите сумму каждой строки двумерного массива – c4,5.

# 1) Ең қымбат тауардың бағасы мен саны
prices = [1200, 1500, 990, 1500, 800]
print("Ең қымбат:", max(prices), "| Саны:", prices.count(max(prices)))

# 2) Әр студенттің орташа бағасы
grades = [[85,90,78],[70,88,92],[95,100,87]]
for i, row in enumerate(grades, 1):
    print(f"{i}-студент орташа:", sum(row)/len(row))